age = int(input("Ваш возраст: "))

match age:
    case 20:
        print("двадцать лет")
    case 21:
        print("двадцать один год")
    case 22:
        print("двадцать два года")
    case 23:
        print("двадцать три года")
    case 24:
        print("двадцать четыре года")
    case 25:
        print("двадцать пять лет")
    case 26:
        print("двадцать шесть лет")
    case 27:
        print("двадцать семь лет")
    case 28:
        print("двадцать восемь лет")
    case 29:
        print("двадцать девять лет")
    case 30:
        print("тридцать лет")
    case 31:
        print("тридцать один год")
    case 32:
        print("тридцать два года")
    case 33:
        print("тридцать три года")
    case 34:
        print("тридцать четыре года")
    case 35:
        print("тридцать пять лет")
    case 36:
        print("тридцать шесть лет")
    case 37:
        print("тридцать семь лет")
    case 38:
        print("тридцать восемь лет")
    case 39:
        print("тридцать девять лет")
    case 40:
        print("сорок лет")
    case 41:
        print("сорок один год")
    case 42:
        print("сорок два года")
    case 43:
        print("сорок три года")
    case 44:
        print("сорок четыре года")
    case 45:
        print("сорок пять лет")
    case 46:
        print("сорок шесть лет")
    case 47:
        print("сорок семь лет")
    case 48:
        print("сорок восемь лет")
    case 49:
        print("сорок девять лет")
    case 50:
        print("пятьдесят лет")
    case 51:
        print("пятьдесят один год")
    case 52:
        print("пятьдесят два года")
    case 53:
        print("пятьдесят три года")
    case 54:
        print("пятьдесят четыре года")
    case 55:
        print("пятьдесят пять лет")
    case 56:
        print("пятьдесят шесть лет")
    case 57:
        print("пятьдесят семь лет")
    case 58:
        print("пятьдесят восемь лет")
    case 59:
        print("пятьдесят девять лет")
    case 60:
        print("шестьдесят лет")
    case 61:
        print("шестьдесят один год")
    case 62:
        print("шестьдесят два года")
    case 63:
        print("шестьдесят три года")
    case 64:
        print("шестьдесят четыре года")
    case 65:
        print("шестьдесят пять лет")
    case 66:
        print("шестьдесят шесть лет")
    case 67:
        print("шестьдесят семь лет")
    case 68:
        print("шестьдесят восемь лет")
    case 69:
        print("шестьдесят девять лет")
    case _:
        print("Неверный возраст")