l = int(input())

match l:
    case 10:
        print(10, "Десять учебных заданий")
    case 11:
        print(11, "Одиннадцать учебных заданий")
    case 12:
        print(12, "Двенадцать учебных заданий")
    case 13:
        print(13, "Тринадцать учебных заданий")
    case 14:
        print(14, "Четырнадцать учебных заданий")
    case 15:
        print(15, "Пятнадцать учебных заданий")
    case 16:
        print(16, "Шестнадцать учебных заданий")
    case 17:
        print(17, "Семнадцать учебных заданий")
    case 18:
        print(18, "Восемнадцать учебных заданий")
    case 19:
        print(19, "Девятнадцать учебных заданий")
    case 20:
        print(20, "Двадцать учебных заданий")
    case 21:
        print(21, "Двадцать одно учебное задание")
    case 22:
        print(22, "Двадцать два учебных задания")
    case 23:
        print(23, "Двадцать три учебных задания")
    case 24:
        print(24, "Двадцать четыре учебных задания")
    case 25:
        print(25, "Двадцать пять учебных заданий")
    case 26:
        print(26, "Двадцать шесть учебных заданий")
    case 27:
        print(27, "Двадцать семь учебных заданий")
    case 28:
        print(28, "Двадцать восемь учебных заданий")
    case 29:
        print(29, "Двадцать девять учебных заданий")
    case 30:
        print(30, "Тридцать учебных заданий")
    case 31:
        print(31, "Тридцать одно учебное задание")
    case 32:
        print(32, "Тридцать два учебных задания")
    case 33:
        print(33, "Тридцать три учебных задания")
    case 34:
        print(34, "Тридцать четыре учебных задания")
    case 35:
        print(35, "Тридцать пять учебных заданий")
    case 36:
        print(36, "Тридцать шесть учебных заданий")
    case 37:
        print(37, "Тридцать семь учебных заданий")
    case 38:
        print(38, "Тридцать восемь учебных заданий")
    case 39:
        print(39, "Тридцать девять учебных заданий")
    case 40:
        print(40, "Сорок учебных заданий")
    case _:
        print("Неверное количество")