num = int(input("Введите число от 100 до 999: "))

match num:
    case 100:
        print(100, "- Сто")
    case 101:
        print(101, "- Сто один")
    case 102:
        print(102, "- Сто два")
    case 103:
        print(103, "- Сто три")
    case 104:
        print(104, "- Сто четыре")
    case 105:
        print(105, "- Сто пять")
    case 106:
        print(106, "- Сто шесть")
    case 107:
        print(107, "- Сто семь")
    case 108:
        print(108, "- Сто восемь")
    case 109:
        print(109, "- Сто девять")
    case 110:
        print(110, "- Сто десять")
    case 111:
        print(111, "- Сто одиннадцать")
    case 112:
        print(112, "- Сто двенадцать")
    case 113:
        print(113, "- Сто тринадцать")
    case 114:
        print(114, "- Сто четырнадцать")
    case 115:
        print(115, "- Сто пятнадцать")
    case 116:
        print(116, "- Сто шестнадцать")
    case 117:
        print(117, "- Сто семнадцать")
    case 118:
        print(118, "- Сто восемнадцать")
    case 119:
        print(119, "- Сто девятнадцать")
    case 120:
        print(120, "- Сто двадцать")
    case 121:
        print(121, "- Сто двадцать один")
    case 122:
        print(122, "- Сто двадцать два")
    case 123:
        print(123, "- Сто двадцать три")
    case 124:
        print(124, "- Сто двадцать четыре")
    case 125:
        print(125, "- Сто двадцать пять")
    case 126:
        print(126, "- Сто двадцать шесть")
    case 127:
        print(127, "- Сто двадцать семь")
    case 128:
        print(128, "- Сто двадцать восемь")
    case 129:
        print(129, "- Сто двадцать девять")
    case 130:
        print(130, "- Сто тридцать")
    case 131:
        print(131, "- Сто тридцать один")
    case 132:
        print(132, "- Сто тридцать два")
    case 133:
        print(133, "- Сто тридцать три")
    case 134:
        print(134, "- Сто тридцать четыре")
    case 135:
        print(135, "- Сто тридцать пять")
    case 136:
        print(136, "- Сто тридцать шесть")
    case 137:
        print(137, "- Сто тридцать семь")
    case 138:
        print(138, "- Сто тридцать восемь")
    case 139:
        print(139, "- Сто тридцать девять")
    case 140:
        print(140, "- Сто сорок")
    case 141:
        print(141, "- Сто сорок один")
    case 142:
        print(142, "- Сто сорок два")
    case 143:
        print(143, "- Сто сорок три")
    case 144:
        print(144, "- Сто сорок четыре")
    case 145:
        print(145, "- Сто сорок пять")
    case 146:
        print(146, "- Сто сорок шесть")
    case 147:
        print(147, "- Сто сорок семь")
    case 148:
        print(148, "- Сто сорок восемь")
    case 149:
        print(149, "- Сто сорок девять")
    case 150:
        print(150, "- Сто пятьдесят")
    case 151:
        print(151, "- Сто пятьдесят один")
    case 152:
        print(152, "- Сто пятьдесят два")
    case 153:
        print(153, "- Сто пятьдесят три")
    case 154:
        print(154, "- Сто пятьдесят четыре")
    case 155:
        print(155, "- Сто пятьдесят пять")
    case 156:
        print(156, "- Сто пятьдесят шесть")
    case 157:
        print(157, "- Сто пятьдесят семь")
    case 158:
        print(158, "- Сто пятьдесят восемь")
    case 159:
        print(159, "- Сто пятьдесят девять")
    case 160:
        print(160, "- Сто шестьдесят")
    case 161:
        print(161, "- Сто шестьдесят один")
    case 162:
        print(162, "- Сто шестьдесят два")
    case 163:
        print(163, "- Сто шестьдесят три")
    case 164:
        print(164, "- Сто шестьдесят четыре")
    case 165:
        print(165, "- Сто шестьдесят пять")
    case 166:
        print(166, "- Сто шестьдесят шесть")
    case 167:
        print(167, "- Сто шестьдесят семь")
    case 168:
        print(168, "- Сто шестьдесят восемь")
    case 169:
        print(169, "- Сто шестьдесят девять")
    case 170:
        print(170, "- Сто семьдесят")
    case 171:
        print(171, "- Сто семьдесят один")
    case 172:
        print(172, "- Сто семьдесят два")
    case 173:
        print(173, "- Сто семьдесят три")
    case 174:
        print(174, "- Сто семьдесят четыре")
    case 175:
        print(175, "- Сто семьдесят пять")
    case 176:
        print(176, "- Сто семьдесят шесть")
    case 177:
        print(177, "- Сто семьдесят семь")
    case 178:
        print(178, "- Сто семьдесят восемь")
    case 179:
        print(179, "- Сто семьдесят девять")
    case 180:
        print(180, "- Сто восемьдесят")
    case 181:
        print(181, "- Сто восемьдесят один")
    case 182:
        print(182, "- Сто восемьдесят два")
    case 183:
        print(183, "- Сто восемьдесят три")
    case 184:
        print(184, "- Сто восемьдесят четыре")
    case 185:
        print(185, "- Сто восемьдесят пять")
    case 186:
        print(186, "- Сто восемьдесят шесть")
    case 187:
        print(187, "- Сто восемьдесят семь")
    case 188:
        print(188, "- Сто восемьдесят восемь")
    case 189:
        print(189, "- Сто восемьдесят девять")
    case 190:
        print(190, "- Сто девяносто")
    case 191:
        print(191, "- Сто девяносто один")
    case 192:
        print(192, "- Сто девяносто два")
    case 193:
        print(193, "- Сто девяносто три")
    case 194:
        print(194, "- Сто девяносто четыре")
    case 195:
        print(195, "- Сто девяносто пять")
    case 196:
        print(196, "- Сто девяносто шесть")
    case 197:
        print(197, "- Сто девяносто семь")
    case 198:
        print(198, "- Сто девяносто восемь")
    case 199:
        print(199, "- Сто девяносто девять")
    case 200:
        print(200, "- Двести")
    case 201:
        print(201, "- Двести один")
    case 202:
        print(202, "- Двести два")
    case 203:
        print(203, "- Двести три")
    case 204:
        print(204, "- Двести четыре")
    case 205:
        print(205, "- Двести пять")
    case 206:
        print(206, "- Двести шесть")
    case 207:
        print(207, "- Двести семь")
    case 208:
        print(208, "- Двести восемь")
    case 209:
        print(209, "- Двести девять")
    case 210:
        print(210, "- Двести десять")
    case 211:
        print(211, "- Двести одиннадцать")
    case 212:
        print(212, "- Двести двенадцать")
    case 213:
        print(213, "- Двести тринадцать")
    case 214:
        print(214, "- Двести четырнадцать")
    case 215:
        print(215, "- Двести пятнадцать")
    case 216:
        print(216, "- Двести шестнадцать")
    case 217:
        print(217, "- Двести семнадцать")
    case 218:
        print(218, "- Двести восемнадцать")
    case 219:
        print(219, "- Двести девятнадцать")
    case 220:
        print(220, "- Двести двадцать")
    case 221:
        print(221, "- Двести двадцать один")
    case 222:
        print(222, "- Двести двадцать два")
    case 223:
        print(223, "- Двести двадцать три")
    case 224:
        print(224, "- Двести двадцать четыре")
    case 225:
        print(225, "- Двести двадцать пять")
    case 226:
        print(226, "- Двести двадцать шесть")
    case 227:
        print(227, "- Двести двадцать семь")
    case 228:
        print(228, "- Двести двадцать восемь")
    case 229:
        print(229, "- Двести двадцать девять")
    case 230:
        print(230, "- Двести тридцать")
    case 231:
        print(231, "- Двести тридцать один")
    case 232:
        print(232, "- Двести тридцать два")
    case 233:
        print(233, "- Двести тридцать три")
    case 234:
        print(234, "- Двести тридцать четыре")
    case 235:
        print(235, "- Двести тридцать пять")
    case 236:
        print(236, "- Двести тридцать шесть")
    case 237:
        print(237, "- Двести тридцать семь")
    case 238:
        print(238, "- Двести тридцать восемь")
    case 239:
        print(239, "- Двести тридцать девять")
    case 240:
        print(240, "- Двести сорок")
    case 241:
        print(241, "- Двести сорок один")
    case 242:
        print(242, "- Двести сорок два")
    case 243:
        print(243, "- Двести сорок три")
    case 244:
        print(244, "- Двести сорок четыре")
    case 245:
        print(245, "- Двести сорок пять")
    case 246:
        print(246, "- Двести сорок шесть")
    case 247:
        print(247, "- Двести сорок семь")
    case 248:
        print(248, "- Двести сорок восемь")
    case 249:
        print(249, "- Двести сорок девять")
    case 250:
        print(250, "- Двести пятьдесят")
    case 251:
        print(251, "- Двести пятьдесят один")
    case 252:
        print(252, "- Двести пятьдесят два")
    case 253:
        print(253, "- Двести пятьдесят три")
    case 254:
        print(254, "- Двести пятьдесят четыре")
    case 255:
        print(255, "- Двести пятьдесят пять")
    case 256:
        print(256, "- Двести пятьдесят шесть")
    case 257:
        print(257, "- Двести пятьдесят семь")
    case 258:
        print(258, "- Двести пятьдесят восемь")
    case 259:
        print(259, "- Двести пятьдесят девять")
    case 260:
        print(260, "- Двести шестьдесят")
    case 261:
        print(261, "- Двести шестьдесят один")
    case 262:
        print(262, "- Двести шестьдесят два")
    case 263:
        print(263, "- Двести шестьдесят три")
    case 264:
        print(264, "- Двести шестьдесят четыре")
    case 265:
        print(265, "- Двести шестьдесят пять")
    case 266:
        print(266, "- Двести шестьдесят шесть")
    case 267:
        print(267, "- Двести шестьдесят семь")
    case 268:
        print(268, "- Двести шестьдесят восемь")
    case 269:
        print(269, "- Двести шестьдесят девять")
    case 270:
        print(270, "- Двести семьдесят")
    case 271:
        print(271, "- Двести семьдесят один")
    case 272:
        print(272, "- Двести семьдесят два")
    case 273:
        print(273, "- Двести семьдесят три")
    case 274:
        print(274, "- Двести семьдесят четыре")
    case 275:
        print(275, "- Двести семьдесят пять")
    case 276:
        print(276, "- Двести семьдесят шесть")
    case 277:
        print(277, "- Двести семьдесят семь")
    case 278:
        print(278, "- Двести семьдесят восемь")
    case 279:
        print(279, "- Двести семьдесят девять")
    case 280:
        print(280, "- Двести восемьдесят")
    case 281:
        print(281, "- Двести восемьдесят один")
    case 282:
        print(282, "- Двести восемьдесят два")
    case 283:
        print(283, "- Двести восемьдесят три")
    case 284:
        print(284, "- Двести восемьдесят четыре")
    case 285:
        print(285, "- Двести восемьдесят пять")
    case 286:
        print(286, "- Двести восемьдесят шесть")
    case 287:
        print(287, "- Двести восемьдесят семь")
    case 288:
        print(288, "- Двести восемьдесят восемь")
    case 289:
        print(289, "- Двести восемьдесят девять")
    case 290:
        print(290, "- Двести девяносто")
    case 291:
        print(291, "- Двести девяносто один")
    case 292:
        print(292, "- Двести девяносто два")
    case 293:
        print(293, "- Двести девяносто три")
    case 294:
        print(294, "- Двести девяносто четыре")
    case 295:
        print(295, "- Двести девяносто пять")
    case 296:
        print(296, "- Двести девяносто шесть")
    case 297:
        print(297, "- Двести девяносто семь")
    case 298:
        print(298, "- Двести девяносто восемь")
    case 299:
        print(299, "- Двести девяносто девять")
    case 300:
        print(300, "- Тристо")
    case 301:
        print(301, "- Тристо один")
    case 302:
        print(302, "- Тристо два")
    case 303:
        print(303, "- Тристо три")
    case 304:
        print(304, "- Тристо четыре")
    case 305:
        print(305, "- Тристо пять")
    case 306:
        print(306, "- Тристо шесть")
    case 307:
        print(307, "- Тристо семь")
    case 308:
        print(308, "- Тристо восемь")
    case 309:
        print(309, "- Тристо девять")
    case 310:
        print(310, "- Тристо десять")
    case 311:
        print(311, "- Тристо одиннадцать")
    case 312:
        print(312, "- Тристо двенадцать")
    case 313:
        print(313, "- Тристо тринадцать")
    case 314:
        print(314, "- Тристо четырнадцать")
    case 315:
        print(315, "- Тристо пятнадцать")
    case 316:
        print(316, "- Тристо шестнадцать")
    case 317:
        print(317, "- Тристо семнадцать")
    case 318:
        print(318, "- Тристо восемнадцать")
    case 319:
        print(319, "- Тристо девятнадцать")
    case 320:
        print(320, "- Тристо двадцать")
    case 321:
        print(321, "- Тристо двадцать один")
    case 322:
        print(322, "- Тристо двадцать два")
    case 323:
        print(323, "- Тристо двадцать три")
    case 324:
        print(324, "- Тристо двадцать четыре")
    case 325:
        print(325, "- Тристо двадцать пять")
    case 326:
        print(326, "- Тристо двадцать шесть")
    case 327:
        print(327, "- Тристо двадцать семь")
    case 328:
        print(328, "- Тристо двадцать восемь")
    case 329:
        print(329, "- Тристо двадцать девять")
    case 330:
        print(330, "- Тристо тридцать")
    case 331:
        print(331, "- Тристо тридцать один")
    case 332:
        print(332, "- Тристо тридцать два")
    case 333:
        print(333, "- Тристо тридцать три")
    case 334:
        print(334, "- Тристо тридцать четыре")
    case 335:
        print(335, "- Тристо тридцать пять")
    case 336:
        print(336, "- Тристо тридцать шесть")
    case 337:
        print(337, "- Тристо тридцать семь")
    case 338:
        print(338, "- Тристо тридцать восемь")
    case 339:
        print(339, "- Тристо тридцать девять")
    case 340:
        print(340, "- Тристо сорок")
    case 341:
        print(341, "- Тристо сорок один")
    case 342:
        print(342, "- Тристо сорок два")
    case 343:
        print(343, "- Тристо сорок три")
    case 344:
        print(344, "- Тристо сорок четыре")
    case 345:
        print(345, "- Тристо сорок пять")
    case 346:
        print(346, "- Тристо сорок шесть")
    case 347:
        print(347, "- Тристо сорок семь")
    case 348:
        print(348, "- Тристо сорок восемь")
    case 349:
        print(349, "- Тристо сорок девять")
    case 350:
        print(350, "- Тристо пятьдесят")
    case 351:
        print(351, "- Тристо пятьдесят один")
    case 352:
        print(352, "- Тристо пятьдесят два")
    case 353:
        print(353, "- Тристо пятьдесят три")
    case 354:
        print(354, "- Тристо пятьдесят четыре")
    case 355:
        print(355, "- Тристо пятьдесят пять")
    case 356:
        print(356, "- Тристо пятьдесят шесть")
    case 357:
        print(357, "- Тристо пятьдесят семь")
    case 358:
        print(358, "- Тристо пятьдесят восемь")
    case 359:
        print(359, "- Тристо пятьдесят девять")
    case 360:
        print(360, "- Тристо шестьдесят")
    case 361:
        print(361, "- Тристо шестьдесят один")
    case 362:
        print(362, "- Тристо шестьдесят два")
    case 363:
        print(363, "- Тристо шестьдесят три")
    case 364:
        print(364, "- Тристо шестьдесят четыре")
    case 365:
        print(365, "- Тристо шестьдесят пять")
    case 366:
        print(366, "- Тристо шестьдесят шесть")
    case 367:
        print(367, "- Тристо шестьдесят семь")
    case 368:
        print(368, "- Тристо шестьдесят восемь")
    case 369:
        print(369, "- Тристо шестьдесят девять")
    case 370:
        print(370, "- Тристо семьдесят")
    case 371:
        print(371, "- Тристо семьдесят один")
    case 372:
        print(372, "- Тристо семьдесят два")
    case 373:
        print(373, "- Тристо семьдесят три")
    case 374:
        print(374, "- Тристо семьдесят четыре")
    case 375:
        print(375, "- Тристо семьдесят пять")
    case 376:
        print(376, "- Тристо семьдесят шесть")
    case 377:
        print(377, "- Тристо семьдесят семь")
    case 378:
        print(378, "- Тристо семьдесят восемь")
    case 379:
        print(379, "- Тристо семьдесят девять")
    case 380:
        print(380, "- Тристо восемьдесят")
    case 381:
        print(381, "- Тристо восемьдесят один")
    case 382:
        print(382, "- Тристо восемьдесят два")
    case 383:
        print(383, "- Тристо восемьдесят три")
    case 384:
        print(384, "- Тристо восемьдесят четыре")
    case 385:
        print(385, "- Тристо восемьдесят пять")
    case 386:
        print(386, "- Тристо восемьдесят шесть")
    case 387:
        print(387, "- Тристо восемьдесят семь")
    case 388:
        print(388, "- Тристо восемьдесят восемь")
    case 389:
        print(389, "- Тристо восемьдесят девять")
    case 390:
        print(390, "- Тристо девяносто")
    case 391:
        print(391, "- Тристо девяносто один")
    case 392:
        print(392, "- Тристо девяносто два")
    case 393:
        print(393, "- Тристо девяносто три")
    case 394:
        print(394, "- Тристо девяносто четыре")
    case 395:
        print(395, "- Тристо девяносто пять")
    case 396:
        print(396, "- Тристо девяносто шесть")
    case 397:
        print(397, "- Тристо девяносто семь")
    case 398:
        print(398, "- Тристо девяносто восемь")
    case 399:
        print(399, "- Тристо девяносто девять")
    case 400:
        print(400, "- Четыреста")
    case 401:
        print(401, "- Четыреста один")
    case 402:
        print(402, "- Четыреста два")
    case 403:
        print(403, "- Четыреста три")
    case 404:
        print(404, "- Четыреста четыре")
    case 405:
        print(405, "- Четыреста пять")
    case 406:
        print(406, "- Четыреста шесть")
    case 407:
        print(407, "- Четыреста семь")
    case 408:
        print(408, "- Четыреста восемь")
    case 409:
        print(409, "- Четыреста девять")
    case 410:
        print(410, "- Четыреста десять")
    case 411:
        print(411, "- Четыреста одиннадцать")
    case 412:
        print(412, "- Четыреста двенадцать")
    case 413:
        print(413, "- Четыреста тринадцать")
    case 414:
        print(414, "- Четыреста четырнадцать")
    case 415:
        print(415, "- Четыреста пятнадцать")
    case 416:
        print(416, "- Четыреста шестнадцать")
    case 417:
        print(417, "- Четыреста семнадцать")
    case 418:
        print(418, "- Четыреста восемнадцать")
    case 419:
        print(419, "- Четыреста девятнадцать")
    case 420:
        print(420, "- Четыреста двадцать")
    case 421:
        print(421, "- Четыреста двадцать один")
    case 422:
        print(422, "- Четыреста двадцать два")
    case 423:
        print(423, "- Четыреста двадцать три")
    case 424:
        print(424, "- Четыреста двадцать четыре")
    case 425:
        print(425, "- Четыреста двадцать пять")
    case 426:
        print(426, "- Четыреста двадцать шесть")
    case 427:
        print(427, "- Четыреста двадцать семь")
    case 428:
        print(428, "- Четыреста двадцать восемь")
    case 429:
        print(429, "- Четыреста двадцать девять")
    case 430:
        print(430, "- Четыреста тридцать")
    case 431:
        print(431, "- Четыреста тридцать один")
    case 432:
        print(432, "- Четыреста тридцать два")
    case 433:
        print(433, "- Четыреста тридцать три")
    case 434:
        print(434, "- Четыреста тридцать четыре")
    case 435:
        print(435, "- Четыреста тридцать пять")
    case 436:
        print(436, "- Четыреста тридцать шесть")
    case 437:
        print(437, "- Четыреста тридцать семь")
    case 438:
        print(438, "- Четыреста тридцать восемь")
    case 439:
        print(439, "- Четыреста тридцать девять")
    case 440:
        print(440, "- Четыреста сорок")
    case 441:
        print(441, "- Четыреста сорок один")
    case 442:
        print(442, "- Четыреста сорок два")
    case 443:
        print(443, "- Четыреста сорок три")
    case 444:
        print(444, "- Четыреста сорок четыре")
    case 445:
        print(445, "- Четыреста сорок пять")
    case 446:
        print(446, "- Четыреста сорок шесть")
    case 447:
        print(447, "- Четыреста сорок семь")
    case 448:
        print(448, "- Четыреста сорок восемь")
    case 449:
        print(449, "- Четыреста сорок девять")
    case 450:
        print(450, "- Четыреста пятьдесят")
    case 451:
        print(451, "- Четыреста пятьдесят один")
    case 452:
        print(452, "- Четыреста пятьдесят два")
    case 453:
        print(453, "- Четыреста пятьдесят три")
    case 454:
        print(454, "- Четыреста пятьдесят четыре")
    case 455:
        print(455, "- Четыреста пятьдесят пять")
    case 456:
        print(456, "- Четыреста пятьдесят шесть")
    case 457:
        print(457, "- Четыреста пятьдесят семь")
    case 458:
        print(458, "- Четыреста пятьдесят восемь")
    case 459:
        print(459, "- Четыреста пятьдесят девять")
    case 460:
        print(460, "- Четыреста шестьдесят")
    case 461:
        print(461, "- Четыреста шестьдесят один")
    case 462:
        print(462, "- Четыреста шестьдесят два")
    case 463:
        print(463, "- Четыреста шестьдесят три")
    case 464:
        print(464, "- Четыреста шестьдесят четыре")
    case 465:
        print(465, "- Четыреста шестьдесят пять")
    case 466:
        print(466, "- Четыреста шестьдесят шесть")
    case 467:
        print(467, "- Четыреста шестьдесят семь")
    case 468:
        print(468, "- Четыреста шестьдесят восемь")
    case 469:
        print(469, "- Четыреста шестьдесят девять")
    case 470:
        print(470, "- Четыреста семьдесят")
    case 471:
        print(471, "- Четыреста семьдесят один")
    case 472:
        print(472, "- Четыреста семьдесят два")
    case 473:
        print(473, "- Четыреста семьдесят три")
    case 474:
        print(474, "- Четыреста семьдесят четыре")
    case 475:
        print(475, "- Четыреста семьдесят пять")
    case 476:
        print(476, "- Четыреста семьдесят шесть")
    case 477:
        print(477, "- Четыреста семьдесят семь")
    case 478:
        print(478, "- Четыреста семьдесят восемь")
    case 479:
        print(479, "- Четыреста семьдесят девять")
    case 480:
        print(480, "- Четыреста восемьдесят")
    case 481:
        print(481, "- Четыреста восемьдесят один")
    case 482:
        print(482, "- Четыреста восемьдесят два")
    case 483:
        print(483, "- Четыреста восемьдесят три")
    case 484:
        print(484, "- Четыреста восемьдесят четыре")
    case 485:
        print(485, "- Четыреста восемьдесят пять")
    case 486:
        print(486, "- Четыреста восемьдесят шесть")
    case 487:
        print(487, "- Четыреста восемьдесят семь")
    case 488:
        print(488, "- Четыреста восемьдесят восемь")
    case 489:
        print(489, "- Четыреста восемьдесят девять")
    case 490:
        print(490, "- Четыреста девяносто")
    case 491:
        print(491, "- Четыреста девяносто один")
    case 492:
        print(492, "- Четыреста девяносто два")
    case 493:
        print(493, "- Четыреста девяносто три")
    case 494:
        print(494, "- Четыреста девяносто четыре")
    case 495:
        print(495, "- Четыреста девяносто пять")
    case 496:
        print(496, "- Четыреста девяносто шесть")
    case 497:
        print(497, "- Четыреста девяносто семь")
    case 498:
        print(498, "- Четыреста девяносто восемь")
    case 499:
        print(499, "- Четыреста девяносто девять")
    case 500:
        print(500, "- Пятьсот")
    case 501:
        print(501, "- Пятьсот один")
    case 502:
        print(502, "- Пятьсот два")
    case 503:
        print(503, "- Пятьсот три")
    case 504:
        print(504, "- Пятьсот четыре")
    case 505:
        print(505, "- Пятьсот пять")
    case 506:
        print(506, "- Пятьсот шесть")
    case 507:
        print(507, "- Пятьсот семь")
    case 508:
        print(508, "- Пятьсот восемь")
    case 509:
        print(509, "- Пятьсот девять")
    case 510:
        print(510, "- Пятьсот десять")
    case 511:
        print(511, "- Пятьсот одиннадцать")
    case 512:
        print(512, "- Пятьсот двенадцать")
    case 513:
        print(513, "- Пятьсот тринадцать")
    case 514:
        print(514, "- Пятьсот четырнадцать")
    case 515:
        print(515, "- Пятьсот пятнадцать")
    case 516:
        print(516, "- Пятьсот шестнадцать")
    case 517:
        print(517, "- Пятьсот семнадцать")
    case 518:
        print(518, "- Пятьсот восемнадцать")
    case 519:
        print(519, "- Пятьсот девятнадцать")
    case 520:
        print(520, "- Пятьсот двадцать")
    case 521:
        print(521, "- Пятьсот двадцать один")
    case 522:
        print(522, "- Пятьсот двадцать два")
    case 523:
        print(523, "- Пятьсот двадцать три")
    case 524:
        print(524, "- Пятьсот двадцать четыре")
    case 525:
        print(525, "- Пятьсот двадцать пять")
    case 526:
        print(526, "- Пятьсот двадцать шесть")
    case 527:
        print(527, "- Пятьсот двадцать семь")
    case 528:
        print(528, "- Пятьсот двадцать восемь")
    case 529:
        print(529, "- Пятьсот двадцать девять")
    case 530:
        print(530, "- Пятьсот тридцать")
    case 531:
        print(531, "- Пятьсот тридцать один")
    case 532:
        print(532, "- Пятьсот тридцать два")
    case 533:
        print(533, "- Пятьсот тридцать три")
    case 534:
        print(534, "- Пятьсот тридцать четыре")
    case 535:
        print(535, "- Пятьсот тридцать пять")
    case 536:
        print(536, "- Пятьсот тридцать шесть")
    case 537:
        print(537, "- Пятьсот тридцать семь")
    case 538:
        print(538, "- Пятьсот тридцать восемь")
    case 539:
        print(539, "- Пятьсот тридцать девять")
    case 540:
        print(540, "- Пятьсот сорок")
    case 541:
        print(541, "- Пятьсот сорок один")
    case 542:
        print(542, "- Пятьсот сорок два")
    case 543:
        print(543, "- Пятьсот сорок три")
    case 544:
        print(544, "- Пятьсот сорок четыре")
    case 545:
        print(545, "- Пятьсот сорок пять")
    case 546:
        print(546, "- Пятьсот сорок шесть")
    case 547:
        print(547, "- Пятьсот сорок семь")
    case 548:
        print(548, "- Пятьсот сорок восемь")
    case 549:
        print(549, "- Пятьсот сорок девять")
    case 550:
        print(550, "- Пятьсот пятьдесят")
    case 551:
        print(551, "- Пятьсот пятьдесят один")
    case 552:
        print(552, "- Пятьсот пятьдесят два")
    case 553:
        print(553, "- Пятьсот пятьдесят три")
    case 554:
        print(554, "- Пятьсот пятьдесят четыре")
    case 555:
        print(555, "- Пятьсот пятьдесят пять")
    case 556:
        print(556, "- Пятьсот пятьдесят шесть")
    case 557:
        print(557, "- Пятьсот пятьдесят семь")
    case 558:
        print(558, "- Пятьсот пятьдесят восемь")
    case 559:
        print(559, "- Пятьсот пятьдесят девять")
    case 560:
        print(560, "- Пятьсот шестьдесят")
    case 561:
        print(561, "- Пятьсот шестьдесят один")
    case 562:
        print(562, "- Пятьсот шестьдесят два")
    case 563:
        print(563, "- Пятьсот шестьдесят три")
    case 564:
        print(564, "- Пятьсот шестьдесят четыре")
    case 565:
        print(565, "- Пятьсот шестьдесят пять")
    case 566:
        print(566, "- Пятьсот шестьдесят шесть")
    case 567:
        print(567, "- Пятьсот шестьдесят семь")
    case 568:
        print(568, "- Пятьсот шестьдесят восемь")
    case 569:
        print(569, "- Пятьсот шестьдесят девять")
    case 570:
        print(570, "- Пятьсот семьдесят")
    case 571:
        print(571, "- Пятьсот семьдесят один")
    case 572:
        print(572, "- Пятьсот семьдесят два")
    case 573:
        print(573, "- Пятьсот семьдесят три")
    case 574:
        print(574, "- Пятьсот семьдесят четыре")
    case 575:
        print(575, "- Пятьсот семьдесят пять")
    case 576:
        print(576, "- Пятьсот семьдесят шесть")
    case 577:
        print(577, "- Пятьсот семьдесят семь")
    case 578:
        print(578, "- Пятьсот семьдесят восемь")
    case 579:
        print(579, "- Пятьсот семьдесят девять")
    case 580:
        print(580, "- Пятьсот восемьдесят")
    case 581:
        print(581, "- Пятьсот восемьдесят один")
    case 582:
        print(582, "- Пятьсот восемьдесят два")
    case 583:
        print(583, "- Пятьсот восемьдесят три")
    case 584:
        print(584, "- Пятьсот восемьдесят четыре")
    case 585:
        print(585, "- Пятьсот восемьдесят пять")
    case 586:
        print(586, "- Пятьсот восемьдесят шесть")
    case 587:
        print(587, "- Пятьсот восемьдесят семь")
    case 588:
        print(588, "- Пятьсот восемьдесят восемь")
    case 589:
        print(589, "- Пятьсот восемьдесят девять")
    case 590:
        print(590, "- Пятьсот девяносто")
    case 591:
        print(591, "- Пятьсот девяносто один")
    case 592:
        print(592, "- Пятьсот девяносто два")
    case 593:
        print(593, "- Пятьсот девяносто три")
    case 594:
        print(594, "- Пятьсот девяносто четыре")
    case 595:
        print(595, "- Пятьсот девяносто пять")
    case 596:
        print(596, "- Пятьсот девяносто шесть")
    case 597:
        print(597, "- Пятьсот девяносто семь")
    case 598:
        print(598, "- Пятьсот девяносто восемь")
    case 599:
        print(599, "- Пятьсот девяносто девять")
    case 600:
        print(600, "- Шестьсот")
    case 601:
        print(601, "- Шестьсот один")
    case 602:
        print(602, "- Шестьсот два")
    case 603:
        print(603, "- Шестьсот три")
    case 604:
        print(604, "- Шестьсот четыре")
    case 605:
        print(605, "- Шестьсот пять")
    case 606:
        print(606, "- Шестьсот шесть")
    case 607:
        print(607, "- Шестьсот семь")
    case 608:
        print(608, "- Шестьсот восемь")
    case 609:
        print(609, "- Шестьсот девять")
    case 610:
        print(610, "- Шестьсот десять")
    case 611:
        print(611, "- Шестьсот одиннадцать")
    case 612:
        print(612, "- Шестьсот двенадцать")
    case 613:
        print(613, "- Шестьсот тринадцать")
    case 614:
        print(614, "- Шестьсот четырнадцать")
    case 615:
        print(615, "- Шестьсот пятнадцать")
    case 616:
        print(616, "- Шестьсот шестнадцать")
    case 617:
        print(617, "- Шестьсот семнадцать")
    case 618:
        print(618, "- Шестьсот восемнадцать")
    case 619:
        print(619, "- Шестьсот девятнадцать")
    case 620:
        print(620, "- Шестьсот двадцать")
    case 621:
        print(621, "- Шестьсот двадцать один")
    case 622:
        print(622, "- Шестьсот двадцать два")
    case 623:
        print(623, "- Шестьсот двадцать три")
    case 624:
        print(624, "- Шестьсот двадцать четыре")
    case 625:
        print(625, "- Шестьсот двадцать пять")
    case 626:
        print(626, "- Шестьсот двадцать шесть")
    case 627:
        print(627, "- Шестьсот двадцать семь")
    case 628:
        print(628, "- Шестьсот двадцать восемь")
    case 629:
        print(629, "- Шестьсот двадцать девять")
    case 630:
        print(630, "- Шестьсот тридцать")
    case 631:
        print(631, "- Шестьсот тридцать один")
    case 632:
        print(632, "- Шестьсот тридцать два")
    case 633:
        print(633, "- Шестьсот тридцать три")
    case 634:
        print(634, "- Шестьсот тридцать четыре")
    case 635:
        print(635, "- Шестьсот тридцать пять")
    case 636:
        print(636, "- Шестьсот тридцать шесть")
    case 637:
        print(637, "- Шестьсот тридцать семь")
    case 638:
        print(638, "- Шестьсот тридцать восемь")
    case 639:
        print(639, "- Шестьсот тридцать девять")
    case 640:
        print(640, "- Шестьсот сорок")
    case 641:
        print(641, "- Шестьсот сорок один")
    case 642:
        print(642, "- Шестьсот сорок два")
    case 643:
        print(643, "- Шестьсот сорок три")
    case 644:
        print(644, "- Шестьсот сорок четыре")
    case 645:
        print(645, "- Шестьсот сорок пять")
    case 646:
        print(646, "- Шестьсот сорок шесть")
    case 647:
        print(647, "- Шестьсот сорок семь")
    case 648:
        print(648, "- Шестьсот сорок восемь")
    case 649:
        print(649, "- Шестьсот сорок девять")
    case 650:
        print(650, "- Шестьсот пятьдесят")
    case 651:
        print(651, "- Шестьсот пятьдесят один")
    case 652:
        print(652, "- Шестьсот пятьдесят два")
    case 653:
        print(653, "- Шестьсот пятьдесят три")
    case 654:
        print(654, "- Шестьсот пятьдесят четыре")
    case 655:
        print(655, "- Шестьсот пятьдесят пять")
    case 656:
        print(656, "- Шестьсот пятьдесят шесть")
    case 657:
        print(657, "- Шестьсот пятьдесят семь")
    case 658:
        print(658, "- Шестьсот пятьдесят восемь")
    case 659:
        print(659, "- Шестьсот пятьдесят девять")
    case 660:
        print(660, "- Шестьсот шестьдесят")
    case 661:
        print(661, "- Шестьсот шестьдесят один")
    case 662:
        print(662, "- Шестьсот шестьдесят два")
    case 663:
        print(663, "- Шестьсот шестьдесят три")
    case 664:
        print(664, "- Шестьсот шестьдесят четыре")
    case 665:
        print(665, "- Шестьсот шестьдесят пять")
    case 666:
        print(666, "- Шестьсот шестьдесят шесть")
    case 667:
        print(667, "- Шестьсот шестьдесят семь")
    case 668:
        print(668, "- Шестьсот шестьдесят восемь")
    case 669:
        print(669, "- Шестьсот шестьдесят девять")
    case 670:
        print(670, "- Шестьсот семьдесят")
    case 671:
        print(671, "- Шестьсот семьдесят один")
    case 672:
        print(672, "- Шестьсот семьдесят два")
    case 673:
        print(673, "- Шестьсот семьдесят три")
    case 674:
        print(674, "- Шестьсот семьдесят четыре")
    case 675:
        print(675, "- Шестьсот семьдесят пять")
    case 676:
        print(676, "- Шестьсот семьдесят шесть")
    case 677:
        print(677, "- Шестьсот семьдесят семь")
    case 678:
        print(678, "- Шестьсот семьдесят восемь")
    case 679:
        print(679, "- Шестьсот семьдесят девять")
    case 680:
        print(680, "- Шестьсот восемьдесят")
    case 681:
        print(681, "- Шестьсот восемьдесят один")
    case 682:
        print(682, "- Шестьсот восемьдесят два")
    case 683:
        print(683, "- Шестьсот восемьдесят три")
    case 684:
        print(684, "- Шестьсот восемьдесят четыре")
    case 685:
        print(685, "- Шестьсот восемьдесят пять")
    case 686:
        print(686, "- Шестьсот восемьдесят шесть")
    case 687:
        print(687, "- Шестьсот восемьдесят семь")
    case 688:
        print(688, "- Шестьсот восемьдесят восемь")
    case 689:
        print(689, "- Шестьсот восемьдесят девять")
    case 690:
        print(690, "- Шестьсот девяносто")
    case 691:
        print(691, "- Шестьсот девяносто один")
    case 692:
        print(692, "- Шестьсот девяносто два")
    case 693:
        print(693, "- Шестьсот девяносто три")
    case 694:
        print(694, "- Шестьсот девяносто четыре")
    case 695:
        print(695, "- Шестьсот девяносто пять")
    case 696:
        print(696, "- Шестьсот девяносто шесть")
    case 697:
        print(697, "- Шестьсот девяносто семь")
    case 698:
        print(698, "- Шестьсот девяносто восемь")
    case 699:
        print(699, "- Шестьсот девяносто девять")
    case 700:
        print(700, "- Семьсот")
    case 701:
        print(701, "- Семьсот один")
    case 702:
        print(702, "- Семьсот два")
    case 703:
        print(703, "- Семьсот три")
    case 704:
        print(704, "- Семьсот четыре")
    case 705:
        print(705, "- Семьсот пять")
    case 706:
        print(706, "- Семьсот шесть")
    case 707:
        print(707, "- Семьсот семь")
    case 708:
        print(708, "- Семьсот восемь")
    case 709:
        print(709, "- Семьсот девять")
    case 710:
        print(710, "- Семьсот десять")
    case 711:
        print(711, "- Семьсот одиннадцать")
    case 712:
        print(712, "- Семьсот двенадцать")
    case 713:
        print(713, "- Семьсот тринадцать")
    case 714:
        print(714, "- Семьсот четырнадцать")
    case 715:
        print(715, "- Семьсот пятнадцать")
    case 716:
        print(716, "- Семьсот шестнадцать")
    case 717:
        print(717, "- Семьсот семнадцать")
    case 718:
        print(718, "- Семьсот восемнадцать")
    case 719:
        print(719, "- Семьсот девятнадцать")
    case 720:
        print(720, "- Семьсот двадцать")
    case 721:
        print(721, "- Семьсот двадцать один")
    case 722:
        print(722, "- Семьсот двадцать два")
    case 723:
        print(723, "- Семьсот двадцать три")
    case 724:
        print(724, "- Семьсот двадцать четыре")
    case 725:
        print(725, "- Семьсот двадцать пять")
    case 726:
        print(726, "- Семьсот двадцать шесть")
    case 727:
        print(727, "- Семьсот двадцать семь")
    case 728:
        print(728, "- Семьсот двадцать восемь")
    case 729:
        print(729, "- Семьсот двадцать девять")
    case 730:
        print(730, "- Семьсот тридцать")
    case 731:
        print(731, "- Семьсот тридцать один")
    case 732:
        print(732, "- Семьсот тридцать два")
    case 733:
        print(733, "- Семьсот тридцать три")
    case 734:
        print(734, "- Семьсот тридцать четыре")
    case 735:
        print(735, "- Семьсот тридцать пять")
    case 736:
        print(736, "- Семьсот тридцать шесть")
    case 737:
        print(737, "- Семьсот тридцать семь")
    case 738:
        print(738, "- Семьсот тридцать восемь")
    case 739:
        print(739, "- Семьсот тридцать девять")
    case 740:
        print(740, "- Семьсот сорок")
    case 741:
        print(741, "- Семьсот сорок один")
    case 742:
        print(742, "- Семьсот сорок два")
    case 743:
        print(743, "- Семьсот сорок три")
    case 744:
        print(744, "- Семьсот сорок четыре")
    case 745:
        print(745, "- Семьсот сорок пять")
    case 746:
        print(746, "- Семьсот сорок шесть")
    case 747:
        print(747, "- Семьсот сорок семь")
    case 748:
        print(748, "- Семьсот сорок восемь")
    case 749:
        print(749, "- Семьсот сорок девять")
    case 750:
        print(750, "- Семьсот пятьдесят")
    case 751:
        print(751, "- Семьсот пятьдесят один")
    case 752:
        print(752, "- Семьсот пятьдесят два")
    case 753:
        print(753, "- Семьсот пятьдесят три")
    case 754:
        print(754, "- Семьсот пятьдесят четыре")
    case 755:
        print(755, "- Семьсот пятьдесят пять")
    case 756:
        print(756, "- Семьсот пятьдесят шесть")
    case 757:
        print(757, "- Семьсот пятьдесят семь")
    case 758:
        print(758, "- Семьсот пятьдесят восемь")
    case 759:
        print(759, "- Семьсот пятьдесят девять")
    case 760:
        print(760, "- Семьсот шестьдесят")
    case 761:
        print(761, "- Семьсот шестьдесят один")
    case 762:
        print(762, "- Семьсот шестьдесят два")
    case 763:
        print(763, "- Семьсот шестьдесят три")
    case 764:
        print(764, "- Семьсот шестьдесят четыре")
    case 765:
        print(765, "- Семьсот шестьдесят пять")
    case 766:
        print(766, "- Семьсот шестьдесят шесть")
    case 767:
        print(767, "- Семьсот шестьдесят семь")
    case 768:
        print(768, "- Семьсот шестьдесят восемь")
    case 769:
        print(769, "- Семьсот шестьдесят девять")
    case 770:
        print(770, "- Семьсот семьдесят")
    case 771:
        print(771, "- Семьсот семьдесят один")
    case 772:
        print(772, "- Семьсот семьдесят два")
    case 773:
        print(773, "- Семьсот семьдесят три")
    case 774:
        print(774, "- Семьсот семьдесят четыре")
    case 775:
        print(775, "- Семьсот семьдесят пять")
    case 776:
        print(776, "- Семьсот семьдесят шесть")
    case 777:
        print(777, "- Семьсот семьдесят семь")
    case 778:
        print(778, "- Семьсот семьдесят восемь")
    case 779:
        print(779, "- Семьсот семьдесят девять")
    case 780:
        print(780, "- Семьсот восемьдесят")
    case 781:
        print(781, "- Семьсот восемьдесят один")
    case 782:
        print(782, "- Семьсот восемьдесят два")
    case 783:
        print(783, "- Семьсот восемьдесят три")
    case 784:
        print(784, "- Семьсот восемьдесят четыре")
    case 785:
        print(785, "- Семьсот восемьдесят пять")
    case 786:
        print(786, "- Семьсот восемьдесят шесть")
    case 787:
        print(787, "- Семьсот восемьдесят семь")
    case 788:
        print(788, "- Семьсот восемьдесят восемь")
    case 789:
        print(789, "- Семьсот восемьдесят девять")
    case 790:
        print(790, "- Семьсот девяносто")
    case 791:
        print(791, "- Семьсот девяносто один")
    case 792:
        print(792, "- Семьсот девяносто два")
    case 793:
        print(793, "- Семьсот девяносто три")
    case 794:
        print(794, "- Семьсот девяносто четыре")
    case 795:
        print(795, "- Семьсот девяносто пять")
    case 796:
        print(796, "- Семьсот девяносто шесть")
    case 797:
        print(797, "- Семьсот девяносто семь")
    case 798:
        print(798, "- Семьсот девяносто восемь")
    case 799:
        print(799, "- Семьсот девяносто девять")
    case 800:
        print(800, "- Восемьсот")
    case 801:
        print(801, "- Восемьсот один")
    case 802:
        print(802, "- Восемьсот два")
    case 803:
        print(803, "- Восемьсот три")
    case 804:
        print(804, "- Восемьсот четыре")
    case 805:
        print(805, "- Восемьсот пять")
    case 806:
        print(806, "- Восемьсот шесть")
    case 807:
        print(807, "- Восемьсот семь")
    case 808:
        print(808, "- Восемьсот восемь")
    case 809:
        print(809, "- Восемьсот девять")
    case 810:
        print(810, "- Восемьсот десять")
    case 811:
        print(811, "- Восемьсот одиннадцать")
    case 812:
        print(812, "- Восемьсот двенадцать")
    case 813:
        print(813, "- Восемьсот тринадцать")
    case 814:
        print(814, "- Восемьсот четырнадцать")
    case 815:
        print(815, "- Восемьсот пятнадцать")
    case 816:
        print(816, "- Восемьсот шестнадцать")
    case 817:
        print(817, "- Восемьсот семнадцать")
    case 818:
        print(818, "- Восемьсот восемнадцать")
    case 819:
        print(819, "- Восемьсот девятнадцать")
    case 820:
        print(820, "- Восемьсот двадцать")
    case 821:
        print(821, "- Восемьсот двадцать один")
    case 822:
        print(822, "- Восемьсот двадцать два")
    case 823:
        print(823, "- Восемьсот двадцать три")
    case 824:
        print(824, "- Восемьсот двадцать четыре")
    case 825:
        print(825, "- Восемьсот двадцать пять")
    case 826:
        print(826, "- Восемьсот двадцать шесть")
    case 827:
        print(827, "- Восемьсот двадцать семь")
    case 828:
        print(828, "- Восемьсот двадцать восемь")
    case 829:
        print(829, "- Восемьсот двадцать девять")
    case 830:
        print(830, "- Восемьсот тридцать")
    case 831:
        print(831, "- Восемьсот тридцать один")
    case 832:
        print(832, "- Восемьсот тридцать два")
    case 833:
        print(833, "- Восемьсот тридцать три")
    case 834:
        print(834, "- Восемьсот тридцать четыре")
    case 835:
        print(835, "- Восемьсот тридцать пять")
    case 836:
        print(836, "- Восемьсот тридцать шесть")
    case 837:
        print(837, "- Восемьсот тридцать семь")
    case 838:
        print(838, "- Восемьсот тридцать восемь")
    case 839:
        print(839, "- Восемьсот тридцать девять")
    case 840:
        print(840, "- Восемьсот сорок")
    case 841:
        print(841, "- Восемьсот сорок один")
    case 842:
        print(842, "- Восемьсот сорок два")
    case 843:
        print(843, "- Восемьсот сорок три")
    case 844:
        print(844, "- Восемьсот сорок четыре")
    case 845:
        print(845, "- Восемьсот сорок пять")
    case 846:
        print(846, "- Восемьсот сорок шесть")
    case 847:
        print(847, "- Восемьсот сорок семь")
    case 848:
        print(848, "- Восемьсот сорок восемь")
    case 849:
        print(849, "- Восемьсот сорок девять")
    case 850:
        print(850, "- Восемьсот пятьдесят")
    case 851:
        print(851, "- Восемьсот пятьдесят один")
    case 852:
        print(852, "- Восемьсот пятьдесят два")
    case 853:
        print(853, "- Восемьсот пятьдесят три")
    case 854:
        print(854, "- Восемьсот пятьдесят четыре")
    case 855:
        print(855, "- Восемьсот пятьдесят пять")
    case 856:
        print(856, "- Восемьсот пятьдесят шесть")
    case 857:
        print(857, "- Восемьсот пятьдесят семь")
    case 858:
        print(858, "- Восемьсот пятьдесят восемь")
    case 859:
        print(859, "- Восемьсот пятьдесят девять")
    case 860:
        print(860, "- Восемьсот шестьдесят")
    case 861:
        print(861, "- Восемьсот шестьдесят один")
    case 862:
        print(862, "- Восемьсот шестьдесят два")
    case 863:
        print(863, "- Восемьсот шестьдесят три")
    case 864:
        print(864, "- Восемьсот шестьдесят четыре")
    case 865:
        print(865, "- Восемьсот шестьдесят пять")
    case 866:
        print(866, "- Восемьсот шестьдесят шесть")
    case 867:
        print(867, "- Восемьсот шестьдесят семь")
    case 868:
        print(868, "- Восемьсот шестьдесят восемь")
    case 869:
        print(869, "- Восемьсот шестьдесят девять")
    case 870:
        print(870, "- Восемьсот семьдесят")
    case 871:
        print(871, "- Восемьсот семьдесят один")
    case 872:
        print(872, "- Восемьсот семьдесят два")
    case 873:
        print(873, "- Восемьсот семьдесят три")
    case 874:
        print(874, "- Восемьсот семьдесят четыре")
    case 875:
        print(875, "- Восемьсот семьдесят пять")
    case 876:
        print(876, "- Восемьсот семьдесят шесть")
    case 877:
        print(877, "- Восемьсот семьдесят семь")
    case 878:
        print(878, "- Восемьсот семьдесят восемь")
    case 879:
        print(879, "- Восемьсот семьдесят девять")
    case 880:
        print(880, "- Восемьсот восемьдесят")
    case 881:
        print(881, "- Восемьсот восемьдесят один")
    case 882:
        print(882, "- Восемьсот восемьдесят два")
    case 883:
        print(883, "- Восемьсот восемьдесят три")
    case 884:
        print(884, "- Восемьсот восемьдесят четыре")
    case 885:
        print(885, "- Восемьсот восемьдесят пять")
    case 886:
        print(886, "- Восемьсот восемьдесят шесть")
    case 887:
        print(887, "- Восемьсот восемьдесят семь")
    case 888:
        print(888, "- Восемьсот восемьдесят восемь")
    case 889:
        print(889, "- Восемьсот восемьдесят девять")
    case 890:
        print(890, "- Восемьсот девяносто")
    case 891:
        print(891, "- Восемьсот девяносто один")
    case 892:
        print(892, "- Восемьсот девяносто два")
    case 893:
        print(893, "- Восемьсот девяносто три")
    case 894:
        print(894, "- Восемьсот девяносто четыре")
    case 895:
        print(895, "- Восемьсот девяносто пять")
    case 896:
        print(896, "- Восемьсот девяносто шесть")
    case 897:
        print(897, "- Восемьсот девяносто семь")
    case 898:
        print(898, "- Восемьсот девяносто восемь")
    case 899:
        print(899, "- Восемьсот девяносто девять")
    case 900:
        print(900, "- Девятьсот")
    case 901:
        print(901, "- Девятьсот один")
    case 902:
        print(902, "- Девятьсот два")
    case 903:
        print(903, "- Девятьсот три")
    case 904:
        print(904, "- Девятьсот четыре")
    case 905:
        print(905, "- Девятьсот пять")
    case 906:
        print(906, "- Девятьсот шесть")
    case 907:
        print(907, "- Девятьсот семь")
    case 908:
        print(908, "- Девятьсот восемь")
    case 909:
        print(909, "- Девятьсот девять")
    case 910:
        print(910, "- Девятьсот десять")
    case 911:
        print(911, "- Девятьсот одиннадцать")
    case 912:
        print(912, "- Девятьсот двенадцать")
    case 913:
        print(913, "- Девятьсот тринадцать")
    case 914:
        print(914, "- Девятьсот четырнадцать")
    case 915:
        print(915, "- Девятьсот пятнадцать")
    case 916:
        print(916, "- Девятьсот шестнадцать")
    case 917:
        print(917, "- Девятьсот семнадцать")
    case 918:
        print(918, "- Девятьсот восемнадцать")
    case 919:
        print(919, "- Девятьсот девятнадцать")
    case 920:
        print(920, "- Девятьсот двадцать")
    case 921:
        print(921, "- Девятьсот двадцать один")
    case 922:
        print(922, "- Девятьсот двадцать два")
    case 923:
        print(923, "- Девятьсот двадцать три")
    case 924:
        print(924, "- Девятьсот двадцать четыре")
    case 925:
        print(925, "- Девятьсот двадцать пять")
    case 926:
        print(926, "- Девятьсот двадцать шесть")
    case 927:
        print(927, "- Девятьсот двадцать семь")
    case 928:
        print(928, "- Девятьсот двадцать восемь")
    case 929:
        print(929, "- Девятьсот двадцать девять")
    case 930:
        print(930, "- Девятьсот тридцать")
    case 931:
        print(931, "- Девятьсот тридцать один")
    case 932:
        print(932, "- Девятьсот тридцать два")
    case 933:
        print(933, "- Девятьсот тридцать три")
    case 934:
        print(934, "- Девятьсот тридцать четыре")
    case 935:
        print(935, "- Девятьсот тридцать пять")
    case 936:
        print(936, "- Девятьсот тридцать шесть")
    case 937:
        print(937, "- Девятьсот тридцать семь")
    case 938:
        print(938, "- Девятьсот тридцать восемь")
    case 939:
        print(939, "- Девятьсот тридцать девять")
    case 940:
        print(940, "- Девятьсот сорок")
    case 941:
        print(941, "- Девятьсот сорок один")
    case 942:
        print(942, "- Девятьсот сорок два")
    case 943:
        print(943, "- Девятьсот сорок три")
    case 944:
        print(944, "- Девятьсот сорок четыре")
    case 945:
        print(945, "- Девятьсот сорок пять")
    case 946:
        print(946, "- Девятьсот сорок шесть")
    case 947:
        print(947, "- Девятьсот сорок семь")
    case 948:
        print(948, "- Девятьсот сорок восемь")
    case 949:
        print(949, "- Девятьсот сорок девять")
    case 950:
        print(950, "- Девятьсот пятьдесят")
    case 951:
        print(951, "- Девятьсот пятьдесят один")
    case 952:
        print(952, "- Девятьсот пятьдесят два")
    case 953:
        print(953, "- Девятьсот пятьдесят три")
    case 954:
        print(954, "- Девятьсот пятьдесят четыре")
    case 955:
        print(955, "- Девятьсот пятьдесят пять")
    case 956:
        print(956, "- Девятьсот пятьдесят шесть")
    case 957:
        print(957, "- Девятьсот пятьдесят семь")
    case 958:
        print(958, "- Девятьсот пятьдесят восемь")
    case 959:
        print(959, "- Девятьсот пятьдесят девять")
    case 960:
        print(960, "- Девятьсот шестьдесят")
    case 961:
        print(961, "- Девятьсот шестьдесят один")
    case 962:
        print(962, "- Девятьсот шестьдесят два")
    case 963:
        print(963, "- Девятьсот шестьдесят три")
    case 964:
        print(964, "- Девятьсот шестьдесят четыре")
    case 965:
        print(965, "- Девятьсот шестьдесят пять")
    case 966:
        print(966, "- Девятьсот шестьдесят шесть")
    case 967:
        print(967, "- Девятьсот шестьдесят семь")
    case 968:
        print(968, "- Девятьсот шестьдесят восемь")
    case 969:
        print(969, "- Девятьсот шестьдесят девять")
    case 970:
        print(970, "- Девятьсот семьдесят")
    case 971:
        print(971, "- Девятьсот семьдесят один")
    case 972:
        print(972, "- Девятьсот семьдесят два")
    case 973:
        print(973, "- Девятьсот семьдесят три")
    case 974:
        print(974, "- Девятьсот семьдесят четыре")
    case 975:
        print(975, "- Девятьсот семьдесят пять")
    case 976:
        print(976, "- Девятьсот семьдесят шесть")
    case 977:
        print(977, "- Девятьсот семьдесят семь")
    case 978:
        print(978, "- Девятьсот семьдесят восемь")
    case 979:
        print(979, "- Девятьсот семьдесят девять")
    case 980:
        print(980, "- Девятьсот восемьдесят")
    case 981:
        print(981, "- Девятьсот восемьдесят один")
    case 982:
        print(982, "- Девятьсот восемьдесят два")
    case 983:
        print(983, "- Девятьсот восемьдесят три")
    case 984:
        print(984, "- Девятьсот восемьдесят четыре")
    case 985:
        print(985, "- Девятьсот восемьдесят пять")
    case 986:
        print(986, "- Девятьсот восемьдесят шесть")
    case 987:
        print(987, "- Девятьсот восемьдесят семь")
    case 988:
        print(988, "- Девятьсот восемьдесят восемь")
    case 989:
        print(989, "- Девятьсот восемьдесят девять")
    case 990:
        print(990, "- Девятьсот девяносто")
    case 991:
        print(991, "- Девятьсот девяносто один")
    case 992:
        print(992, "- Девятьсот девяносто два")
    case 993:
        print(993, "- Девятьсот девяносто три")
    case 994:
        print(994, "- Девятьсот девяносто четыре")
    case 995:
        print(995, "- Девятьсот девяносто пять")
    case 996:
        print(996, "- Девятьсот девяносто шесть")
    case 997:
        print(997, "- Девятьсот девяносто семь")
    case 998:
        print(998, "- Девятьсот девяносто восемь")
    case 999:
        print(999, "- Девятьсот девяносто девять")
    case _:
        print("Неверное число")